airKill/yarncontrol_driver/src/stm32f4_rtos/User/bsp/src/bsp_uart_fifo.c
/*
*********************************************************************************************************
*
*	模块名称 : 串口中断+FIFO驱动模块
*	文件名称 : bsp_uart_fifo.c
*	版    本 : V1.0
*	说    明 : 采用串口中断+FIFO模式实现多个串口的同时访问
*	修改记录 :
*		版本号  日期       作者    说明
*		V1.0    2013-02-01 armfly  正式发布
*		V1.1    2013-06-09 armfly  FiFo结构增加TxCount成员变量，方便判断缓冲区满; 增加 清FiFo的函数
*		V1.2	2014-09-29 armfly  增加RS485 MODBUS接口。接收到新字节后，直接执行回调函数。
*		V1.3	2015-07-23 armfly  增加 UART_T 结构的读写指针几个成员变量必须增加 __IO 修饰,否则优化后
*					会导致串口发送函数死机。
*		V1.4	2015-08-04 armfly  解决UART4配置bug  GPIO_PinAFConfig(GPIOC, GPIO_PinSource11, GPIO_AF_USART1);
*		V1.5	2015-10-08 armfly  增加修改波特率的接口函数
*
*	Copyright (C), 2015-2020, 安富莱电子 www.armfly.com
*
*********************************************************************************************************
*/

#include "bsp.h"


/* 定义每个串口结构体变量 */
#if UART1_FIFO_EN == 1
UART_T g_tUart1;
uint8_t g_TxBuf1[UART1_TX_BUF_SIZE];		/* 发送缓冲区 */
uint8_t g_RxBuf1[UART1_RX_BUF_SIZE];		/* 接收缓冲区 */
#endif

#if UART2_FIFO_EN == 1
UART_T g_tUart2;
uint8_t g_TxBuf2[UART2_TX_BUF_SIZE];		/* 发送缓冲区 */
uint8_t g_RxBuf2[UART2_RX_BUF_SIZE];		/* 接收缓冲区 */
#endif

#if UART3_FIFO_EN == 1
UART_T g_tUart3;
uint8_t g_TxBuf3[UART3_TX_BUF_SIZE];		/* 发送缓冲区 */
uint8_t g_RxBuf3[UART3_RX_BUF_SIZE];		/* 接收缓冲区 */
#endif

#if UART4_FIFO_EN == 1
UART_T g_tUart4;
uint8_t g_TxBuf4[UART4_TX_BUF_SIZE];		/* 发送缓冲区 */
uint8_t g_RxBuf4[UART4_RX_BUF_SIZE];		/* 接收缓冲区 */
#endif

#if UART5_FIFO_EN == 1
UART_T g_tUart5;
uint8_t g_TxBuf5[UART5_TX_BUF_SIZE];		/* 发送缓冲区 */
uint8_t g_RxBuf5[UART5_RX_BUF_SIZE];		/* 接收缓冲区 */
#endif

#if UART6_FIFO_EN == 1
UART_T g_tUart6;
uint8_t g_TxBuf6[UART6_TX_BUF_SIZE];		/* 发送缓冲区 */
uint8_t g_RxBuf6[UART6_RX_BUF_SIZE];		/* 接收缓冲区 */
#endif

void UartVarInit(void);

void InitHardUart(void);
void UartSend(UART_T *_pUart, uint8_t *_ucaBuf, uint16_t _usLen);
uint8_t UartGetChar(UART_T *_pUart, uint8_t *_pByte);
void UartIRQ(UART_T *_pUart);
void ConfigUartNVIC(void);

void RS485_InitTXE(void);

u8 UART5_RX_BUF[UART5_RX_BUF_SIZE];
u8 UART4_RX_BUF[UART4_RX_BUF_SIZE];
u8 UART2_RX_BUF[UART2_RX_BUF_SIZE];

u8 debug_cmd = 0;
/*
*********************************************************************************************************
*	函 数 名: bsp_InitUart
*	功能说明: 初始化串口硬件，并对全局变量赋初值.
*	形    参:  无
*	返 回 值: 无
*********************************************************************************************************
*/
void bsp_InitUart(void)
{
//  UartVarInit();		/* 必须先初始化全局变量,再配置硬件 */
  InitHardUart();		/* 配置串口的硬件参数(波特率等) */
  RS485_InitTXE();	/* 配置RS485芯片的发送使能硬件，配置为推挽输出 */
  ConfigUartNVIC();	/* 配置串口中断 */
  UartDMAConfig();
  UART1ToPC('\0',1);
  UART2ToPC('\0',1);
  UART3ToPC('\0',1);
  UART4ToPC('\0',1);
  UART5ToPC("hello world",strlen("hello world"));
}

/*
*********************************************************************************************************
*	函 数 名: ComToUart
*	功能说明: 将COM端口号转换为UART指针
*	形    参: _ucPort: 端口号(COM1 - COM6)
*	返 回 值: uart指针
*********************************************************************************************************
*/
UART_T *ComToUart(COM_PORT_E _ucPort)
{
  if (_ucPort == COM1)
  {
#if UART1_FIFO_EN == 1
    return &g_tUart1;
#else
    return 0;
#endif
  }
  else if (_ucPort == COM2)
  {
#if UART2_FIFO_EN == 1
    return &g_tUart2;
#else
    return;
#endif
  }
  else if (_ucPort == COM3)
  {
#if UART3_FIFO_EN == 1
    return &g_tUart3;
#else
    return 0;
#endif
  }
  else if (_ucPort == COM4)
  {
#if UART4_FIFO_EN == 1
    return &g_tUart4;
#else
    return 0;
#endif
  }
  else if (_ucPort == COM5)
  {
#if UART5_FIFO_EN == 1
    return &g_tUart5;
#else
    return 0;
#endif
  }
  else if (_ucPort == COM6)
  {
#if UART6_FIFO_EN == 1
    return &g_tUart6;
#else
    return 0;
#endif
  }
  else
  {
    /* 不做任何处理 */
    return 0;
  }
}


/*
*********************************************************************************************************
*	函 数 名: ComToUart
*	功能说明: 将COM端口号转换为 USART_TypeDef* USARTx
*	形    参: _ucPort: 端口号(COM1 - COM6)
*	返 回 值: USART_TypeDef*,  USART1, USART2, USART3, UART4, UART5
*********************************************************************************************************
*/
USART_TypeDef *ComToUSARTx(COM_PORT_E _ucPort)
{
  if (_ucPort == COM1)
  {
#if UART1_FIFO_EN == 1
    return USART1;
#else
    return 0;
#endif
  }
  else if (_ucPort == COM2)
  {
#if UART2_FIFO_EN == 1
    return USART2;
#else
    return;
#endif
  }
  else if (_ucPort == COM3)
  {
#if UART3_FIFO_EN == 1
    return USART3;
#else
    return 0;
#endif
  }
  else if (_ucPort == COM4)
  {
#if UART4_FIFO_EN == 1
    return UART4;
#else
    return 0;
#endif
  }
  else if (_ucPort == COM5)
  {
#if UART5_FIFO_EN == 1
    return UART5;
#else
    return 0;
#endif
  }
  else
  {
    /* 不做任何处理 */
    return 0;
  }
}

/*
*********************************************************************************************************
*	函 数 名: comSendBuf
*	功能说明: 向串口发送一组数据。数据放到发送缓冲区后立即返回，由中断服务程序在后台完成发送
*	形    参: _ucPort: 端口号(COM1 - COM6)
*			  _ucaBuf: 待发送的数据缓冲区
*			  _usLen : 数据长度
*	返 回 值: 无
*********************************************************************************************************
*/
void comSendBuf(COM_PORT_E _ucPort, uint8_t *_ucaBuf, uint16_t _usLen)
{
  UART_T *pUart;
  
  pUart = ComToUart(_ucPort);
  if (pUart == 0)
  {
    return;
  }
  
  if (pUart->SendBefor != 0)
  {
    pUart->SendBefor();		/* 如果是RS485通信，可以在这个函数中将RS485设置为发送模式 */
  }
  
  UartSend(pUart, _ucaBuf, _usLen);
}

/*
*********************************************************************************************************
*	函 数 名: comSendChar
*	功能说明: 向串口发送1个字节。数据放到发送缓冲区后立即返回，由中断服务程序在后台完成发送
*	形    参: _ucPort: 端口号(COM1 - COM6)
*			  _ucByte: 待发送的数据
*	返 回 值: 无
*********************************************************************************************************
*/
void comSendChar(COM_PORT_E _ucPort, uint8_t _ucByte)
{
  comSendBuf(_ucPort, &_ucByte, 1);
}

/*
*********************************************************************************************************
*	函 数 名: comGetChar
*	功能说明: 从接收缓冲区读取1字节，非阻塞。无论有无数据均立即返回。
*	形    参: _ucPort: 端口号(COM1 - COM5)
*			  _pByte: 接收到的数据存放在这个地址
*	返 回 值: 0 表示无数据, 1 表示读取到有效字节
*********************************************************************************************************
*/
uint8_t comGetChar(COM_PORT_E _ucPort, uint8_t *_pByte)
{
  UART_T *pUart;
  
