airKill/yarncontrol_driver/src/stm32f4_rtos/User/bsp/src/bsp_uart_fifo.c
  /* 打开 GPIO 时钟 */
  RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOC, ENABLE);
  
  /* 打开 UART 时钟 */
  RCC_APB1PeriphClockCmd(RCC_APB1Periph_UART4, ENABLE);
  
  /* 将 PC10 映射为 UART4_TX */
  GPIO_PinAFConfig(GPIOC, GPIO_PinSource10, GPIO_AF_UART4);
  
  /* 将 PC11 映射为 UART4_RX */
  GPIO_PinAFConfig(GPIOC, GPIO_PinSource11, GPIO_AF_UART4);
  
  /* 配置 USART Tx 为复用功能 */
  GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;	/* 输出类型为推挽 */
  GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP;	/* 内部上拉电阻使能 */
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;	/* 复用模式 */
  
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_10;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_Init(GPIOC, &GPIO_InitStructure);
  
  /* 配置 USART Rx 为复用功能 */
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_11;
  GPIO_Init(GPIOC, &GPIO_InitStructure);
  
  /* 第2步： 配置串口硬件参数 */
  USART_InitStructure.USART_BaudRate = UART4_BAUD;	/* 波特率 */
  USART_InitStructure.USART_WordLength = USART_WordLength_8b;
  USART_InitStructure.USART_StopBits = USART_StopBits_1;
  USART_InitStructure.USART_Parity = USART_Parity_No ;
  USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_None;
  USART_InitStructure.USART_Mode = USART_Mode_Rx | USART_Mode_Tx;
  USART_Init(UART4, &USART_InitStructure);
  
  USART_ITConfig(UART4, USART_IT_IDLE, ENABLE);	/* 使能接收中断 */
  USART_DMACmd(UART4,USART_DMAReq_Rx,ENABLE);
  /*
  USART_ITConfig(USART1, USART_IT_TXE, ENABLE);
  注意: 不要在此处打开发送中断
  发送中断使能在SendUart()函数打开
  */
  USART_Cmd(UART4, ENABLE);		/* 使能串口 */
  
  /* CPU的小缺陷：串口配置好，如果直接Send，则第1个字节发送不出去
  如下语句解决第1个字节无法正确发送出去的问题 */
  USART_ClearFlag(UART4, USART_FLAG_TC);     /* 清发送完成标志，Transmission Complete flag */
#endif
  
#if UART5_FIFO_EN == 1			/* 串口5 TX = PC12   RX = PD2 */
  /* 第1步： 配置GPIO */
  
  /* 打开 GPIO 时钟 */
  RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOC |RCC_AHB1Periph_GPIOD, ENABLE);
  
  /* 打开 UART 时钟 */
  RCC_APB1PeriphClockCmd(RCC_APB1Periph_UART5, ENABLE);
  
  /* 将 PC12 映射为 UART5_TX */
  GPIO_PinAFConfig(GPIOC, GPIO_PinSource12, GPIO_AF_UART5);
  
  /* 将 PD2 映射为 UART5_RX */
  GPIO_PinAFConfig(GPIOD, GPIO_PinSource2, GPIO_AF_UART5);
  
  /* 配置 UART Tx 为复用功能 */
  GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;	/* 输出类型为推挽 */
  GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP;	/* 内部上拉电阻使能 */
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;	/* 复用模式 */
  
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_12;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_Init(GPIOC, &GPIO_InitStructure);
  
  /* 配置 UART Rx 为复用功能 */
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_2;
  GPIO_Init(GPIOD, &GPIO_InitStructure);
  
  /* 第2步： 配置串口硬件参数 */
  USART_InitStructure.USART_BaudRate = UART5_BAUD;	/* 波特率 */
  USART_InitStructure.USART_WordLength = USART_WordLength_8b;
  USART_InitStructure.USART_StopBits = USART_StopBits_1;
  USART_InitStructure.USART_Parity = USART_Parity_No ;
  USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_None;
  USART_InitStructure.USART_Mode = USART_Mode_Rx | USART_Mode_Tx;
  USART_Init(UART5, &USART_InitStructure);
  
//  USART_ITConfig(UART5, USART_IT_RXNE, ENABLE);
  USART_ITConfig(UART5, USART_IT_IDLE, ENABLE);	/* 使能接收中断 */
  USART_DMACmd(UART5,USART_DMAReq_Rx,ENABLE);
  /*
  USART_ITConfig(USART1, USART_IT_TXE, ENABLE);
  注意: 不要在此处打开发送中断
  发送中断使能在SendUart()函数打开
  */
  USART_Cmd(UART5, ENABLE);		/* 使能串口 */
  
  /* CPU的小缺陷：串口配置好，如果直接Send，则第1个字节发送不出去
  如下语句解决第1个字节无法正确发送出去的问题 */
//  USART_ClearFlag(UART5, USART_FLAG_TC);     /* 清发送完成标志，Transmission Complete flag */
#endif
  
#if UART6_FIFO_EN == 1			/* PG14/USART6_TX , PC7/USART6_RX,PG8/USART6_RTS, PG15/USART6_CTS */
  /* 第1步： 配置GPIO */
  
  /* 打开 GPIO 时钟 */
  RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOC |RCC_AHB1Periph_GPIOG, ENABLE);
  
  /* 打开 UART 时钟 */
  RCC_APB2PeriphClockCmd(RCC_APB2Periph_USART6, ENABLE);
  
  /* 将 PG14 映射为 USART6_TX */
  GPIO_PinAFConfig(GPIOG, GPIO_PinSource14, GPIO_AF_USART6);
  
  /* 将 PC7 映射为 USART6_RX */
  GPIO_PinAFConfig(GPIOC, GPIO_PinSource7, GPIO_AF_USART6);
  
  /* 将 PG8 映射为 USART6_RTS */
  GPIO_PinAFConfig(GPIOG, GPIO_PinSource8, GPIO_AF_USART6);
  
  /* 将 PG15 映射为 USART6_CTS */
  GPIO_PinAFConfig(GPIOG, GPIO_PinSource15, GPIO_AF_USART6);
  
  /* 配置 PG14/USART6_TX 为复用功能 */
  GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;	/* 输出类型为推挽 */
  GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP;	/* 内部上拉电阻使能 */
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;	/* 复用模式 */
  
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_14;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_Init(GPIOG, &GPIO_InitStructure);
  
  /* 配置 PC7/USART6_RX 为复用功能 */
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_7;
  GPIO_Init(GPIOC, &GPIO_InitStructure);
  
  /* 配置 PG8/USART6_RTS 为复用功能 */
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_8;
  GPIO_Init(GPIOG, &GPIO_InitStructure);
  
  /* 配置 PG15/USART6_CTS 为复用功能 */
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_15;
  GPIO_Init(GPIOG, &GPIO_InitStructure);
  
  /* 第2步： 配置串口硬件参数 */
  USART_InitStructure.USART_BaudRate = UART6_BAUD;	/* 波特率 */
  USART_InitStructure.USART_WordLength = USART_WordLength_8b;
  USART_InitStructure.USART_StopBits = USART_StopBits_1;
  USART_InitStructure.USART_Parity = USART_Parity_No ;
  //USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_RTS_CTS;	/* 选择硬件流控 */
  USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_None;	/* 不要硬件流控 */
  USART_InitStructure.USART_Mode = USART_Mode_Rx | USART_Mode_Tx;
  USART_Init(USART6, &USART_InitStructure);
  
  USART_ITConfig(USART6, USART_IT_RXNE, ENABLE);	/* 使能接收中断 */
  /*
  USART_ITConfig(USART1, USART_IT_TXE, ENABLE);
  注意: 不要在此处打开发送中断
  发送中断使能在SendUart()函数打开
  */
  USART_Cmd(USART6, ENABLE);		/* 使能串口 */
  
  /* CPU的小缺陷：串口配置好，如果直接Send，则第1个字节发送不出去
  如下语句解决第1个字节无法正确发送出去的问题 */
  USART_ClearFlag(USART6, USART_FLAG_TC);     /* 清发送完成标志，Transmission Complete flag */
#endif
}

