airKill/yarncontrol_driver/src/stm32f4_rtos/User/bsp/src/bsp_uart_fifo.c
      if (usCount < _pUart->usTxBufSize)
      {
        break;
      }
    }
#endif
    
    /* 将新数据填入发送缓冲区 */
    _pUart->pTxBuf[_pUart->usTxWrite] = _ucaBuf[i];
    
    DISABLE_INT();
    if (++_pUart->usTxWrite >= _pUart->usTxBufSize)
    {
      _pUart->usTxWrite = 0;
    }
    _pUart->usTxCount++;
    ENABLE_INT();
  }
  
  USART_ITConfig(_pUart->uart, USART_IT_TXE, ENABLE);
}

/*
*********************************************************************************************************
*	函 数 名: UartGetChar
*	功能说明: 从串口接收缓冲区读取1字节数据 （用于主程序调用）
*	形    参: _pUart : 串口设备
*			  _pByte : 存放读取数据的指针
*	返 回 值: 0 表示无数据  1表示读取到数据
*********************************************************************************************************
*/
static uint8_t UartGetChar(UART_T *_pUart, uint8_t *_pByte)
{
  uint16_t usCount;
  
  /* usRxWrite 变量在中断函数中被改写，主程序读取该变量时，必须进行临界区保护 */
  DISABLE_INT();
  usCount = _pUart->usRxCount;
  ENABLE_INT();
  
  /* 如果读和写索引相同，则返回0 */
  //if (_pUart->usRxRead == usRxWrite)
  if (usCount == 0)	/* 已经没有数据 */
  {
    return 0;
  }
  else
  {
    *_pByte = _pUart->pRxBuf[_pUart->usRxRead];		/* 从串口接收FIFO取1个数据 */
    
    /* 改写FIFO读索引 */
    DISABLE_INT();
    if (++_pUart->usRxRead >= _pUart->usRxBufSize)
    {
      _pUart->usRxRead = 0;
    }
    _pUart->usRxCount--;
    ENABLE_INT();
    return 1;
  }
}

/*
*********************************************************************************************************
*	函 数 名: UartIRQ
*	功能说明: 供中断服务程序调用，通用串口中断处理函数
*	形    参: _pUart : 串口设备
*	返 回 值: 无
*********************************************************************************************************
*/
static void UartIRQ(UART_T *_pUart)
{
  /* 处理接收中断  */
  if (USART_GetITStatus(_pUart->uart, USART_IT_RXNE) != RESET)
  {
    /* 从串口接收数据寄存器读取数据存放到接收FIFO */
    uint8_t ch;
    
    ch = USART_ReceiveData(_pUart->uart);
    _pUart->pRxBuf[_pUart->usRxWrite] = ch;
    if (++_pUart->usRxWrite >= _pUart->usRxBufSize)
    {
      _pUart->usRxWrite = 0;
    }
    if (_pUart->usRxCount < _pUart->usRxBufSize)
    {
      _pUart->usRxCount++;
    }
    
    /* 回调函数,通知应用程序收到新数据,一般是发送1个消息或者设置一个标记 */
    //if (_pUart->usRxWrite == _pUart->usRxRead)
    //if (_pUart->usRxCount == 1)
    {
      if (_pUart->ReciveNew)
      {
        _pUart->ReciveNew(ch);
      }
    }
  }
  
  /* 处理发送缓冲区空中断 */
  if (USART_GetITStatus(_pUart->uart, USART_IT_TXE) != RESET)
  {
    //if (_pUart->usTxRead == _pUart->usTxWrite)
    if (_pUart->usTxCount == 0)
    {
      /* 发送缓冲区的数据已取完时， 禁止发送缓冲区空中断 （注意：此时最后1个数据还未真正发送完毕）*/
      USART_ITConfig(_pUart->uart, USART_IT_TXE, DISABLE);
      
      /* 使能数据发送完毕中断 */
      USART_ITConfig(_pUart->uart, USART_IT_TC, ENABLE);
    }
    else
    {
      /* 从发送FIFO取1个字节写入串口发送数据寄存器 */
      USART_SendData(_pUart->uart, _pUart->pTxBuf[_pUart->usTxRead]);
      if (++_pUart->usTxRead >= _pUart->usTxBufSize)
      {
        _pUart->usTxRead = 0;
      }
      _pUart->usTxCount--;
    }
    
  }
  /* 数据bit位全部发送完毕的中断 */
  else if (USART_GetITStatus(_pUart->uart, USART_IT_TC) != RESET)
  {
    //if (_pUart->usTxRead == _pUart->usTxWrite)
    if (_pUart->usTxCount == 0)
    {
      /* 如果发送FIFO的数据全部发送完毕，禁止数据发送完毕中断 */
      USART_ITConfig(_pUart->uart, USART_IT_TC, DISABLE);
      
      /* 回调函数, 一般用来处理RS485通信，将RS485芯片设置为接收模式，避免抢占总线 */
      if (_pUart->SendOver)
      {
        _pUart->SendOver();
      }
    }
    else
    {
      /* 正常情况下，不会进入此分支 */
      
      /* 如果发送FIFO的数据还未完毕，则从发送FIFO取1个数据写入发送数据寄存器 */
      USART_SendData(_pUart->uart, _pUart->pTxBuf[_pUart->usTxRead]);
      if (++_pUart->usTxRead >= _pUart->usTxBufSize)
      {
        _pUart->usTxRead = 0;
      }
      _pUart->usTxCount--;
    }
  }
}

/*
*********************************************************************************************************
*	函 数 名: USART1_IRQHandler  USART2_IRQHandler USART3_IRQHandler UART4_IRQHandler UART5_IRQHandler
*	功能说明: USART中断服务程序
*	形    参: 无
*	返 回 值: 无
*********************************************************************************************************
*/
#if UART1_FIFO_EN == 1
void USART1_IRQHandler(void)
{
  u8 temp;
  if(USART_GetITStatus(USART1,USART_IT_RXNE) != RESET)
  {
    temp = USART_ReceiveData(USART1);
    debug_cmd = temp;
  }
}
#endif

#if UART2_FIFO_EN == 1
void USART2_IRQHandler(void)
{
  u16 data;
  u16 UART_ReceiveSize = 0;
//  BaseType_t xHigherPriorityTaskWoken = pdFALSE;
  if(USART_GetITStatus(USART2,USART_IT_IDLE) != RESET)
  {
    DMA_Cmd(DMA1_Stream5, DISABLE);
    data = USART2->SR;
    data = USART2->DR;
    data = data;
    UART_ReceiveSize = UART2_RX_BUF_SIZE - DMA_GetCurrDataCounter(DMA1_Stream5);
//    memcpy(rs485_rev_buf,UART2_RX_BUF,UART_ReceiveSize);
//    rs485_rev_len = UART_ReceiveSize;
//    UART1ToPC(UART2_RX_BUF,UART_ReceiveSize);
    memcpy(m_ctrl_dev.rxbuf,UART2_RX_BUF,UART_ReceiveSize);
    m_ctrl_dev.rxlen = UART_ReceiveSize;
    DMA_ClearFlag(DMA1_Stream5,DMA_FLAG_TCIF5 | DMA_FLAG_FEIF5 | DMA_FLAG_DMEIF5 | DMA_FLAG_TEIF5 | DMA_FLAG_HTIF5);//??DMA1_Steam3??????
    DMA_SetCurrDataCounter(DMA1_Stream5, UART2_RX_BUF_SIZE);
    DMA_Cmd(DMA1_Stream5, ENABLE);
    m_ctrl_dev.frameok = 1;
//    /* 发送同步信号 */
//    xSemaphoreGiveFromISR(xSemaphore_rs485, &xHigherPriorityTaskWoken);
//    /* 如果xHigherPriorityTaskWoken = pdTRUE，那么退出中断后切到当前最高优先级任务执行 */
//    portYIELD_FROM_ISR(xHigherPriorityTaskWoken);
  }
}
#endif

#if UART3_FIFO_EN == 1
void USART3_IRQHandler(void)
{
  UartIRQ(&g_tUart3);
}
#endif

#if UART4_FIFO_EN == 1
void UART4_IRQHandler(void)
{
  u16 data;
  u16 UART_ReceiveSize = 0;
  BaseType_t xHigherPriorityTaskWoken = pdFALSE;
  if(USART_GetITStatus(UART4,USART_IT_IDLE) != RESET)
  {
    DMA_Cmd(DMA1_Stream2, DISABLE);
    data = UART4->SR;
    data = UART4->DR;
    data = data;
    UART_ReceiveSize = UART4_RX_BUF_SIZE - DMA_GetCurrDataCounter(DMA1_Stream2);
    memcpy(lcd_rev_buf,UART4_RX_BUF,UART_ReceiveSize);
    lcd_rev_len = UART_ReceiveSize;
    DMA_ClearFlag(DMA1_Stream2,DMA_FLAG_TCIF2 | DMA_FLAG_FEIF2 | DMA_FLAG_DMEIF2 | DMA_FLAG_TEIF2 | DMA_FLAG_HTIF2);//??DMA1_Steam3??????
    DMA_SetCurrDataCounter(DMA1_Stream2, UART4_RX_BUF_SIZE);
    DMA_Cmd(DMA1_Stream2, ENABLE);
//    UART1ToPC(lcd_rev_buf,lcd_rev_len);
    /* 发送同步信号 */
    xSemaphoreGiveFromISR(xSemaphore_lcd, &xHigherPriorityTaskWoken);
    /* 如果xHigherPriorityTaskWoken = pdTRUE，那么退出中断后切到当前最高优先级任务执行 */
    portYIELD_FROM_ISR(xHigherPriorityTaskWoken);
  }
}
#endif

#if UART5_FIFO_EN == 1
void UART5_IRQHandler(void)
{
  u16 data;
  u16 UART_ReceiveSize = 0;
  if(USART_GetITStatus(UART5,USART_IT_IDLE) != RESET)
  {
    DMA_Cmd(DMA1_Stream0, DISABLE);
    data = UART5->SR;
    data = UART5->DR;
    data = data;
    UART_ReceiveSize = UART5_RX_BUF_SIZE - DMA_GetCurrDataCounter(DMA1_Stream0);
    rfid_rev_cnt = UART_ReceiveSize;
    memcpy(rfid_rev_buf,UART5_RX_BUF,rfid_rev_cnt);
//    UART1ToPC(rfid_rev_buf,rfid_rev_cnt);
    DMA_ClearFlag(DMA1_Stream0,DMA_FLAG_TCIF0 | DMA_FLAG_FEIF0 | DMA_FLAG_DMEIF0 | DMA_FLAG_TEIF0 | DMA_FLAG_HTIF0);//??DMA1_Steam3??????
    DMA_SetCurrDataCounter(DMA1_Stream0, UART5_RX_BUF_SIZE);
    DMA_Cmd(DMA1_Stream0, ENABLE);
    rfid_rev_flag = 1;
  }
}
#endif

#if UART6_FIFO_EN == 1
void USART6_IRQHandler(void)
{
  UartIRQ(&g_tUart6);
}
#endif



void UART1ToPC(u8 *buf,u8 len)
{
  unsigned char i;
  for(i = 0; i < len; i++) 
  {
//    while(USART_GetFlagStatus(USART1, USART_FLAG_TXE) == RESET);
    USART_SendData(USART1, buf[i]);
    while (USART_GetFlagStatus(USART1, USART_FLAG_TC) == RESET);
  }
}

void UART2ToPC(u8 *buf,u8 len)
{
  unsigned char i;
  for(i = 0; i < len; i++) 
  {
//    while(USART_GetFlagStatus(USART2, USART_FLAG_TXE) == RESET);
    USART_SendData(USART2, buf[i]);
    while (USART_GetFlagStatus(USART2, USART_FLAG_TC) == RESET);
  }
}

void RS485_sendbuf(u8 *buf,u8 len)
{
  unsigned char i;
  RS485_TX_EN();
  for(i = 0; i < len; i++) 
  {
//    while(USART_GetFlagStatus(USART2, USART_FLAG_TXE) == RESET);
    USART_SendData(USART2, buf[i]);
    while (USART_GetFlagStatus(USART2, USART_FLAG_TC) == RESET);
  }
  RS485_RX_EN();
  
//  UART1ToPC(buf,len);
}

void UART3ToPC(u8 *buf,u8 len)
{
  unsigned char i;
  for(i = 0; i < len; i++) 
  {
//    while(USART_GetFlagStatus(USART3, USART_FLAG_TXE) == RESET);
    USART_SendData(USART3, buf[i]);
    while (USART_GetFlagStatus(USART3, USART_FLAG_TC) == RESET);
  }
}

void UART4ToPC(u8 *buf,u8 len)
{
  unsigned char i;
  for(i = 0; i < len; i++) 
  {
//    while(USART_GetFlagStatus(UART4, USART_FLAG_TXE) == RESET);
    USART_SendData(UART4, buf[i]);
    while (USART_GetFlagStatus(UART4, USART_FLAG_TC) == RESET);
  }
}

void UART5ToPC(u8 *buf,u8 len)
{
  unsigned char i;
  for(i = 0; i < len; i++) 
  {
//    while(USART_GetFlagStatus(UART5, USART_FLAG_TXE) == RESET);
    USART_SendData(UART5, buf[i]);
    while (USART_GetFlagStatus(UART5, USART_FLAG_TC) == RESET);
  }
}

PUTCHAR_PROTOTYPE
{
  /* Place your implementation of fputc here */
  /* e.g. write a character to the USART */
  while (USART_GetFlagStatus(USART1, USART_FLAG_TXE) == RESET);
  USART_SendData(USART1, (uint8_t) ch);
  
  /* Loop until the end of transmission */
//  while (USART_GetFlagStatus(USART1, USART_FLAG_TC) == RESET)
//  {}
  return ch;
}

/***************************** 安富莱电子 www.armfly.com (END OF FILE) *********************************/
